zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA343/startup_MCXA343.cpp
WEAK void EQDC1_HOME_IRQHandler(void)
{
    EQDC1_HOME_DriverIRQHandler();
}

WEAK void EQDC1_WATCHDOG_IRQHandler(void)
{
    EQDC1_WATCHDOG_DriverIRQHandler();
}

WEAK void EQDC1_INDEX_IRQHandler(void)
{
    EQDC1_INDEX_DriverIRQHandler();
}

WEAK void Reserved105_IRQHandler(void)
{
    Reserved105_DriverIRQHandler();
}

WEAK void Reserved106_IRQHandler(void)
{
    Reserved106_DriverIRQHandler();
}

WEAK void Reserved107_IRQHandler(void)
{
    Reserved107_DriverIRQHandler();
}

WEAK void Reserved108_IRQHandler(void)
{
    Reserved108_DriverIRQHandler();
}

WEAK void Reserved109_IRQHandler(void)
{
    Reserved109_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

WEAK void Reserved111_IRQHandler(void)
{
    Reserved111_DriverIRQHandler();
}

WEAK void Reserved112_IRQHandler(void)
{
    Reserved112_DriverIRQHandler();
}

WEAK void Reserved113_IRQHandler(void)
{
    Reserved113_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{
    Reserved114_DriverIRQHandler();
}

WEAK void Reserved115_IRQHandler(void)
{
    Reserved115_DriverIRQHandler();
}

WEAK void Reserved116_IRQHandler(void)
{
    Reserved116_DriverIRQHandler();
}

WEAK void Reserved117_IRQHandler(void)
{
    Reserved117_DriverIRQHandler();
}

WEAK void Reserved118_IRQHandler(void)
{
    Reserved118_DriverIRQHandler();
}

WEAK void Reserved119_IRQHandler(void)
{
    Reserved119_DriverIRQHandler();
}

WEAK void Reserved120_IRQHandler(void)
{
    Reserved120_DriverIRQHandler();
}

WEAK void Reserved121_IRQHandler(void)
{
    Reserved121_DriverIRQHandler();
}

WEAK void Reserved122_IRQHandler(void)
{
    Reserved122_DriverIRQHandler();
}

WEAK void MAU_IRQHandler(void)
{
    MAU_DriverIRQHandler();
}

WEAK void SMARTDMA_IRQHandler(void)
{
    SMARTDMA_DriverIRQHandler();
}

WEAK void Reserved125_IRQHandler(void)
{
    Reserved125_DriverIRQHandler();
}

WEAK void Reserved126_IRQHandler(void)
{
    Reserved126_DriverIRQHandler();
}

WEAK void Reserved127_IRQHandler(void)
{
    Reserved127_DriverIRQHandler();
}

WEAK void Reserved128_IRQHandler(void)
{
    Reserved128_DriverIRQHandler();
}

WEAK void Reserved129_IRQHandler(void)
{
    Reserved129_DriverIRQHandler();
}

WEAK void Reserved130_IRQHandler(void)
{
    Reserved130_DriverIRQHandler();
}

WEAK void Reserved131_IRQHandler(void)
{
    Reserved131_DriverIRQHandler();
}

WEAK void Reserved132_IRQHandler(void)
{
    Reserved132_DriverIRQHandler();
}

WEAK void Reserved133_IRQHandler(void)
{
    Reserved133_DriverIRQHandler();
}

WEAK void Reserved134_IRQHandler(void)
{
    Reserved134_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void RTC_1HZ_IRQHandler(void)
{
    RTC_1HZ_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
